---
kind: other
id: Methods.T:Autodesk.Revit.DB.PointClouds.IPointCloudAccess
source: html/3701551f-27c8-fb06-d255-4a256a795c20.htm
---
# IPointCloudAccess Methods

Implement this method to return an iterator for iterating over blocks of this point cloud.